In [1]:
import pandas as pd
import pyarrow.parquet as pq
import pyarrow as pa

In [4]:
df = pd.read_parquet("C:\\Users\\nikhi\\Downloads\\capstone\\customer_first.parquet")
df.head()

,customer_id,first_name,last_name,email,city,state
0,C00001,Emily,Mooney,rushjeff@ryan.org,Johnsonmouth,MS
1,C00002,Andrea,Sellers,mccoykiara@kelly.com,Stephenfort,WY
2,C00003,Craig,Hayes,rebeccamiller@yahoo.com,South Stephenshire,LA
3,C00004,Bryan,Scott,lawrence05@campbell.info,Chrisland,ND
4,C00005,Sean,Vasquez,carrie45@yahoo.com,East Dennistown,RI

In [5]:
df.tail()

,customer_id,first_name,last_name,email,city,state
1985,C01986,Jason,Walker,steven08@schaefer.com,Port Cameronborough,SD
1986,C01987,Justin,Stein,phillipkirk@hotmail.com,Dillonview,KS
1987,C01988,Emma,Blackwell,meganjones@wong.net,Portershire,OH
1988,C01989,Victoria,Wright,edavis@webb-parks.com,South James,DE
1989,C01990,David,Davis,matthew76@gmail.com,Gallaghertown,GA

In [6]:
df.tail()[['customer_id', 'email', 'city', 'state']]

     customer_id                    email                 city state
1985      C01986    steven08@schaefer.com  Port Cameronborough    SD
1986      C01987  phillipkirk@hotmail.com           Dillonview    KS
1987      C01988      meganjones@wong.net          Portershire    OH
1988      C01989    edavis@webb-parks.com          South James    DE
1989      C01990      matthew76@gmail.com        Gallaghertown    GA

In [7]:
df[df['customer_id'] == "C01986"]

,customer_id,first_name,last_name,email,city,state
1985,C01986,Jason,Walker,steven08@schaefer.com,Port Cameronborough,SD

In [9]:
df.loc[df['customer_id'] == "C01986", 'email'] = "nikhilchanged_outside@databricks.com"

In [10]:
df[df['customer_id'] == "C01986"]

,customer_id,first_name,last_name,email,city,state
1985,C01986,Jason,Walker,nikhilchanged_outside@databricks.com,Port Cameronborough,SD

In [11]:
df.to_parquet(
    r"C:\Users\nikhi\Downloads\capstone\customer_first_updated.parquet",
    index=False
)

In [13]:
df[df['customer_id'] == "C01990"]

,customer_id,first_name,last_name,email,city,state
1989,C01990,David,Davis,matthew76@gmail.com,Gallaghertown,GA

In [16]:
df.loc[df['customer_id'] == "C01990", 'email'] = "test@abc.com"

In [17]:
df[df['customer_id'] == "C01990"]

     customer_id first_name last_name         email           city state
1989      C01990      David     Davis  test@abc.com  Gallaghertown    GA

In [18]:
df.to_parquet(
    r"C:\Users\nikhi\Downloads\capstone\customer_first_updated.parquet",
    index=False
)